#ДЗ 6.2. Конвертер із числа в дату
# Ваше завдання — написати програму, яка переводить число у формат часу у читальному вигляді.
# Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
# Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
# Ну і додатковим завданням є турбота про виведення.
# Слово "день" підбирається на основі кількості днів, а години, хвилини і секунди повинні заповнюватися нулями при одноцифрових значеннях.
# Підказка: одна хвилина - 60 сек. , В одній годині 60 * 60 сек, в одній добі 24 * 60 * 60 сек. Тобто використовуючи функцію divmod або методи поділу // і % вам необхідно знайти відповідну кількість днів, годин, хвилин, а те що залишиться - це секунди, які менше 60 ;)
# Доповнити провідними нулями можна за допомогою методу zfill(2)
# Приклад: 0 -> 0 днів, 00:00:00   224930 -> 2 дні, 14:28:50   466289 -> 5 днів, 09:31:29
# 950400 -> 11 днів, 00:00:00   1209600 -> 14 днів, 00:00:00   1900800 - > 22 дні, 00:00:00
# 8639999 -> 99 днів, 23:59:59   22493 -> 0 днів, 06:14:53     7948799 -> 91 день, 23:59:59
var=8639999
print(var," => ", end="")
h1=3600
d1=86400
lst1=[1]
lst2=[2, 3, 4]
lst3=[5, 6, 7, 8, 9, 0]
lst4=[11,12,13,14]
#дні
var_day=var//d1
day_word=str(var_day)
d=int(day_word[-1])
dd=int(day_word)
#день-дні-днів
if dd in lst4:
   print(var_day, "днів, ", end="")
elif d in lst1:
   print(var_day, "день, ", end="")
elif d in lst2:
   print(var_day, "дні, ", end="")
elif d in lst3:
   print(var_day, "днів, ", end="")
#години
var_day_end=var%d1
var_hour=var_day_end//h1
var_hour=str(var_hour)
var_hour=var_hour.zfill(2)
print(var_hour,": ", end="")
#хвилини
var_hour_end=var_day_end%h1
var_minute=var_hour_end//60
var_minute=str(var_minute)
var_minute=var_minute.zfill(2)
print(var_minute, ": ", end="")
#секунди
var_minute_end=var_hour_end%60
var_minute_end=str(var_minute_end)
var_minute_end=var_minute_end.zfill(2)
print(var_minute_end, end="")
